In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'Sales':[200,200,350],'Profit':[4,5,6]})

columns=[('Finance','Operation'),('Operation','Finance')]
df.columns=pd.MultiIndex.from_tuples(columns)
df

    Finance Operation
  Operation   Finance
0       200         4
1       200         5
2       350         6

In [3]:
df=pd.DataFrame({'Sales':[200,200,350],'Profit':[4,5,6]})

columns=[('Finance'),('Operation')]
df.columns=pd.MultiIndex.from_tuples(columns)
df

     F  O
     i  p
     n  e
     a  r
     n  a
     c  t
     e  i
   NaN  o
   NaN  n
0  200  4
1  200  5
2  350  6

In [4]:
df= pd.Series(np.array([200,300,400,3]),index= ["Finance",'Operation',"Marketing","Logistics"]).to_frame().T
df.columns = pd.MultiIndex.from_product([["Profit"],df.columns])
df

   Profit
  Finance Operation Marketing Logistics
0     200       300       400         3

In [5]:
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
pd.MultiIndex.from_arrays(arrays, names= ('number', 'color'))

MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

In [6]:
data = pd.DataFrame([[90,67],
            [96,96],
              [89,96],
              [78,90],
              [78,89],
              [89,67]
             ])
data

    0   1
0  90  67
1  96  96
2  89  96
3  78  90
4  78  89
5  89  67

In [7]:
ind =[
    ["Kelvin","Kelvin",'Kelvin',"Mary","Mary","Mary"],
      [2021,2022,2022,2021,2022,2023]
]
ind

[['Kelvin', 'Kelvin', 'Kelvin', 'Mary', 'Mary', 'Mary'],
 [2021, 2022, 2022, 2021, 2022, 2023]]

In [8]:
df = pd.DataFrame(data.values,index = ind, columns  =['Company A','Company B'])
df

             Company A  Company B
Kelvin 2021         90         67
       2022         96         96
       2022         89         96
Mary   2021         78         90
       2022         78         89
       2023         89         67

In [9]:
df.index.names = ['Name','Year']
df

             Company A  Company B
Name   Year
Kelvin 2021         90         67
       2022         96         96
       2022         89         96
Mary   2021         78         90
       2022         78         89
       2023         89         67

In [10]:
scores = np.linspace(60,90,36).reshape(6,6)
data1 =pd.DataFrame(scores)
data1

           0          1          2          3          4          5
0  60.000000  60.857143  61.714286  62.571429  63.428571  64.285714
1  65.142857  66.000000  66.857143  67.714286  68.571429  69.428571
2  70.285714  71.142857  72.000000  72.857143  73.714286  74.571429
3  75.428571  76.285714  77.142857  78.000000  78.857143  79.714286
4  80.571429  81.428571  82.285714  83.142857  84.000000  84.857143
5  85.714286  86.571429  87.428571  88.285714  89.142857  90.000000

In [11]:
ind1 = pd.MultiIndex.from_product([['Kelvin','Jone'],[2021,2022,2023]])
ind1

MultiIndex([('Kelvin', 2021),
            ('Kelvin', 2022),
            ('Kelvin', 2023),
            (  'Jone', 2021),
            (  'Jone', 2022),
            (  'Jone', 2023)],
           )

In [12]:
cols = pd.MultiIndex.from_product([['7th grade','8th grade'],['Math','reading','writing']])
cols

MultiIndex([('7th grade',    'Math'),
            ('7th grade', 'reading'),
            ('7th grade', 'writing'),
            ('8th grade',    'Math'),
            ('8th grade', 'reading'),
            ('8th grade', 'writing')],
           )

In [13]:
df1 =pd.DataFrame(data1.values,ind1,cols)
df1

             7th grade                        8th grade
                  Math    reading    writing       Math    reading    writing
Kelvin 2021  60.000000  60.857143  61.714286  62.571429  63.428571  64.285714
       2022  65.142857  66.000000  66.857143  67.714286  68.571429  69.428571
       2023  70.285714  71.142857  72.000000  72.857143  73.714286  74.571429
Jone   2021  75.428571  76.285714  77.142857  78.000000  78.857143  79.714286
       2022  80.571429  81.428571  82.285714  83.142857  84.000000  84.857143
       2023  85.714286  86.571429  87.428571  88.285714  89.142857  90.000000

In [14]:
df1.index.names = ['Name','Year']
df1.columns.names = ['Grades','Subjects']
df1

Grades       7th grade                        8th grade
Subjects          Math    reading    writing       Math    reading    writing
Name   Year
Kelvin 2021  60.000000  60.857143  61.714286  62.571429  63.428571  64.285714
       2022  65.142857  66.000000  66.857143  67.714286  68.571429  69.428571
       2023  70.285714  71.142857  72.000000  72.857143  73.714286  74.571429
Jone   2021  75.428571  76.285714  77.142857  78.000000  78.857143  79.714286
       2022  80.571429  81.428571  82.285714  83.142857  84.000000  84.857143
       2023  85.714286  86.571429  87.428571  88.285714  89.142857  90.000000

In [15]:
df2 = df1.reset_index(level =['Name','Year'])
df2.columns

MultiIndex([(     'Name',        ''),
            (     'Year',        ''),
            ('7th grade',    'Math'),
            ('7th grade', 'reading'),
            ('7th grade', 'writing'),
            ('8th grade',    'Math'),
            ('8th grade', 'reading'),
            ('8th grade', 'writing')],
           names=['Grades', 'Subjects'])

In [16]:
list1=['01-01-2023','01-01-2023','01-01-2023','02-01-2023','02-01-2023','02-01-2023','03-01-2023','03-01-2023','03-01-2023']
per1 = pd.DataFrame(list1)
df = pd.DataFrame([
    (100,134,'CS'),
    (200,124,'CD'),
    (300,128,'CO'),
     (287,129,'CS'),
     (248,130,'CD'),
    (239,131,'CO'),
    ( 199,132,'CS'),
    ( 278,126,'CD'),
    ( 245,126,'CO')],
 columns = ['Close','Volume','Symbol']  )

df["Date"] = per1
df

   Close  Volume Symbol        Date
0    100     134     CS  01-01-2023
1    200     124     CD  01-01-2023
2    300     128     CO  01-01-2023
3    287     129     CS  02-01-2023
4    248     130     CD  02-01-2023
5    239     131     CO  02-01-2023
6    199     132     CS  03-01-2023
7    278     126     CD  03-01-2023
8    245     126     CO  03-01-2023

In [17]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [18]:
df.groupby(['Symbol']).Close.mean()

Symbol
CD    242.000000
CO    261.333333
CS    195.333333
Name: Close, dtype: float64

In [19]:
ser = df.groupby(['Symbol','Date']).Close.mean()
ser

Symbol  Date
CD      01-01-2023    200.0
        02-01-2023    248.0
        03-01-2023    278.0
CO      01-01-2023    300.0
        02-01-2023    239.0
        03-01-2023    245.0
CS      01-01-2023    100.0
        02-01-2023    287.0
        03-01-2023    199.0
Name: Close, dtype: float64

In [20]:
ser.index

MultiIndex([('CD', '01-01-2023'),
            ('CD', '02-01-2023'),
            ('CD', '03-01-2023'),
            ('CO', '01-01-2023'),
            ('CO', '02-01-2023'),
            ('CO', '03-01-2023'),
            ('CS', '01-01-2023'),
            ('CS', '02-01-2023'),
            ('CS', '03-01-2023')],
           names=['Symbol', 'Date'])

In [21]:
ser.unstack()

Date    01-01-2023  02-01-2023  03-01-2023
Symbol
CD           200.0       248.0       278.0
CO           300.0       239.0       245.0
CS           100.0       287.0       199.0

In [22]:
df.pivot_table(values ='Close',index ='Symbol',columns='Date')

Date    01-01-2023  02-01-2023  03-01-2023
Symbol
CD             200         248         278
CO             300         239         245
CS             100         287         199

In [23]:
ser.loc['CD']

Date
01-01-2023    200.0
02-01-2023    248.0
03-01-2023    278.0
Name: Close, dtype: float64

In [24]:
ser.loc['CD','03-01-2023']

278.0

In [25]:
ser.loc[:,'03-01-2023']

Symbol
CD    278.0
CO    245.0
CS    199.0
Name: Close, dtype: float64

In [26]:
df.set_index(['Symbol','Date'],inplace=True)
df

                   Close  Volume
Symbol Date
CS     01-01-2023    100     134
CD     01-01-2023    200     124
CO     01-01-2023    300     128
CS     02-01-2023    287     129
CD     02-01-2023    248     130
CO     02-01-2023    239     131
CS     03-01-2023    199     132
CD     03-01-2023    278     126
CO     03-01-2023    245     126

In [27]:
df.sort_index()

                   Close  Volume
Symbol Date
CD     01-01-2023    200     124
       02-01-2023    248     130
       03-01-2023    278     126
CO     01-01-2023    300     128
       02-01-2023    239     131
       03-01-2023    245     126
CS     01-01-2023    100     134
       02-01-2023    287     129
       03-01-2023    199     132

In [28]:
df.loc['CD']

            Close  Volume
Date
01-01-2023    200     124
02-01-2023    248     130
03-01-2023    278     126

In [29]:
df.loc[('CD','01-01-2023'),:]

Close     200
Volume    124
Name: (CD, 01-01-2023), dtype: int64

In [30]:
df.loc[('CD','01-01-2023'),'Close']

200

In [31]:
df.loc[(['CD','CO'],'01-01-2023'),'Close']

Symbol  Date
CD      01-01-2023    200
CO      01-01-2023    300
Name: Close, dtype: int64

In [32]:
df.loc[(slice(None),['01-01-2023','03-01-2023']),:]

                   Close  Volume
Symbol Date
CS     01-01-2023    100     134
CD     01-01-2023    200     124
CO     01-01-2023    300     128
CS     03-01-2023    199     132
CD     03-01-2023    278     126
CO     03-01-2023    245     126

In [33]:
df.reset_index()

  Symbol        Date  Close  Volume
0     CS  01-01-2023    100     134
1     CD  01-01-2023    200     124
2     CO  01-01-2023    300     128
3     CS  02-01-2023    287     129
4     CD  02-01-2023    248     130
5     CO  02-01-2023    239     131
6     CS  03-01-2023    199     132
7     CD  03-01-2023    278     126
8     CO  03-01-2023    245     126